Revit 2027 API
BuiltInFailures.DimensionFailures.DimensionPerpendicularToView Property
 The Dimension is perpendicular to the current view, and no longer valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DimensionPerpendicularToView { get; }
Public Shared ReadOnly Property DimensionPerpendicularToView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DimensionPerpendicularToView {
	FailureDefinitionId^ get ();
}
static member DimensionPerpendicularToView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace